### 3. 데이터프레임 데이터 조작

- 탐색을 위한 메소드

In [25]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [26]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [27]:
ans.groupby

NameError: name 'ans' is not defined

- 산술 메소드

In [28]:
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(40,101,20).reshape(4,5),
                    index=list('wxyz'), columns=list('ABCDE'))
df

    A   B   C   D   E
w  92  61  97  40  85
x  70  62  84  67  69
y  61  69  64  52  94
z  46  78  46  73  77

In [29]:
# axis=0 이 디폴트
df.sum()

A    269
B    270
C    291
D    232
E    325
dtype: int64

- 결측치 처리

In [30]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [31]:
# 데이터 전체 중에 결측치가 있는지 확인
titanic.isna().sum().sum()

869

In [32]:
# 어느 열에서 결측치가 있는지 확인
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [33]:
# 대체하는 방법 - 카테고리형일 경우에는 최빈값
titanic.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [34]:
titanic.embark_town = titanic.embark_town.fillna('Southampton')
titanic.embarked = titanic.embarked.fillna('S')
titanic.embarked.isna().sum()

0

In [35]:
# 숫자 - 평균, 중앙값
# age를 평균으로 대체
titanic.age.mean()
titanic.age = titanic.age.fillna(titanic.age.mean())
titanic.age.fillna(titanic.age.mean(), inplace=True)
titanic.age.isna().sum()

0

In [36]:
# 너무 많은 결측치가 있는 열 삭제
titanic2 = titanic
titanic2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [37]:
titanic2.drop(columns=['deck'], inplace=True)
titanic2.isna().sum().sum()

0

In [ ]:
df.평균.astype(int)
df

In [38]:
# dropna() - 결측치가 포함된 행을 삭제
titanic.dropna(inplace=True)
titanic.shape

(891, 14)

- apply 메소드

In [ ]:
def.func(x):
    return x.max() - x.min()

In [ ]:
df3.apply(func1)

In [ ]:
df3(lambda x: x.max() - x.min())

In [ ]:
# 행단위로 하고자 할 경우에는 axis = 1 option을 주어야 함
df3.apply(lambda x:x.max() - x.min(), axis=1)

In [ ]:
# 평균이 70점 이상이면 pass, 아니면 fail인 '결과' 열을 추가할 것

In [ ]:
def fun4(x):
    return '합격' if x.평균 >= 70 else '불합격'

In [42]:
# 1000단위 구분기호 없애기
price_list = []
for i in range(12):
    price = np.random.randint(100,1000,1)[0] * 100
    price_list.append(f'{price:,d}')
price_list

['35,700',
 '46,600',
 '58,100',
 '48,000',
 '84,100',
 '51,000',
 '80,600',
 '58,300',
 '16,300',
 '66,100',
 '75,600',
 '79,000']

In [57]:
# 1000단위 구분기호 없애기
df = pd.DataFrame(np.array(price_list).reshape(3,4), columns=list('ABCD'))
df

        A       B       C       D
0  35,700  46,600  58,100  48,000
1  84,100  51,000  80,600  58,300
2  16,300  66,100  75,600  79,000

In [45]:
price = '125,000'
int(price.replace(',',''))

125000

In [59]:
df.A = df.A.apply(lambda x: int(x.replace(',','')))
df.A

0    35700
1    84100
2    16300
Name: A, dtype: int64

In [60]:
# 왜 안되지 ㅋ
for column in df.columns:
    df[column] = df[column].apply(lambda x: int(x.replace(',','')))
df

AttributeError: 'int' object has no attribute 'replace'

In [70]:
cctv = pd.read_csv('서울시CCTV설치운영현황(자치구)_년도별_210731기준.csv',
                    skiprows=1, encoding='euc-kr')
cctv.head()

,구분,총계,2012년 이전,2012년,2013년,2014년,2015년,2016년,2017년,2018년,2019년,2020년,2021년
0,계,"77,032","7,667","2,200","3,491","4,439","6,582","8,129","9,947","9,876","11,961","11,132","1,608"
1,종로구,"1,772",813,0,0,210,150,1,261,85,9,200,43
2,중 구,"2,333",16,114,87,77,236,240,372,386,155,361,289
3,용산구,"2,383",34,71,234,125,221,298,351,125,307,617,0
4,성동구,"3,602",448,125,212,105,339,310,874,390,262,461,76

In [71]:
for column in cctv.columns[1:]:
    cctv[column] = cctv[column].apply(lambda x: int(x.replace(',','')))
cctv.head()

,구분,총계,2012년 이전,2012년,2013년,2014년,2015년,2016년,2017년,2018년,2019년,2020년,2021년
0,계,77032,7667,2200,3491,4439,6582,8129,9947,9876,11961,11132,1608
1,종로구,1772,813,0,0,210,150,1,261,85,9,200,43
2,중 구,2333,16,114,87,77,236,240,372,386,155,361,289
3,용산구,2383,34,71,234,125,221,298,351,125,307,617,0
4,성동구,3602,448,125,212,105,339,310,874,390,262,461,76